---
kind: method
id: M:Autodesk.Revit.UI.Macros.UIMacroManager.SetUIDocumentMacroSecurityOptions(Autodesk.Revit.UI.UIApplication,Autodesk.Revit.UI.Macros.UIDocumentMacroOptions)
source: html/acc1b7a0-0110-76c0-1dbd-32cf93d74ea4.htm
---
# Autodesk.Revit.UI.Macros.UIMacroManager.SetUIDocumentMacroSecurityOptions Method

Sets the UI document macro security options.

## Syntax (C#)
```csharp
public static void SetUIDocumentMacroSecurityOptions(
	UIApplication application,
	UIDocumentMacroOptions macroOptions
)
```

## Parameters
- **application** (`Autodesk.Revit.UI.UIApplication`) - The UI application.
- **macroOptions** (`Autodesk.Revit.UI.Macros.UIDocumentMacroOptions`) - The UI document macro security options.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was NULL
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration